КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул2/КонтурЛогистика_ПЭ_Титул2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЭ_Титул2</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭксп</name>
    <comment>Уникальный идентификатор документа (УИД) электронного поручения экпедитору, Выдается государственной информационной системой электронных перевозочных документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДок</name>
    <comment>Дата выдачи поручения экспедитору</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвКлиент</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СвЭксп</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДогТрЭксп</name>
    <comment>Реквизиты договора транспортной экспедиции</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Договор</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь1с</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Предназначено для обмена информацией не предусмотренной форматом</comment>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИныеДанныеЭксп</name>
    <attributes>
      <name>ДанныеИОговорки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопИнфЭксп</name>
    <comment>Дополнительная информация экспедитора по согласованным и подлежащим оказанию транспортно-экспедиционным услугам</comment>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризИсп</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортноЭкспедиционныеУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекИдПредст</name>
      <comment>Реквизиты, позволяющие идентифицировать третье лицо, привлеченное экспедитором</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснОкУслИным</name>
      <comment>Реквизиты документа, определяющего основания для оказания иных услуг, связанных с организацией перевозки груза иным лицом, отличным от экспедитора</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщСтУсл</name>
      <comment>СвОплата</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалСт</name>
      <comment>СвОплата</comment>
      <type>
        <types>EnumRef.КонтурЛогистика_СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НаимДок_СвОплата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДок_СвОплата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДок_СвОплата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>DefinedType.КонтурЛогистика_Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеОрганизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОГРН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЮрЛица</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераПартий</name>
      <comment>Общий список номеров партий маршрута</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторыПартий</name>
      <comment>Идентификаторы партий груза </comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвТрсГруз</name>
    <attributes>
      <name>ИдентификаторСтрокиРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентПартГруз</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомПартГруз</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      </type>
    </attributes>
    <attributes>
      <name>МаршСлГруз</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвТсДост</name>
    <comment>Сведения о транспортном средстве, на котором будет осуществлена доставка груза</comment>
    <attributes>
      <name>ИдентификаторСтрокиРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТС</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ВидыТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКузова</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Водители</name>
    <comment>СвВодители</comment>
    <attributes>
      <name>ИдентификаторСтрокиРодитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквНаимДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквНомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст/КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст</name>
  <enumValues>
    <name>_1</name>
  </enumValues>
  <enumValues>
    <name>_2</name>
  </enumValues>
  <enumValues>
    <name>_3</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул2/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовыйДокумент", Не ЗначениеЗаполнено(Ссылка));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.ЭтоНовыйДокумент Тогда
		
		Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик;
		РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, Статус, Истина, Истина);

	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = ТекущаяДатаСеанса();
	УИД_ПорЭксп = "";
	kl_id = "";

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Перем ФайлОбмена;
		
	Если ДанныеЗаполнения <> Неопределено
		 И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		 И ДанныеЗаполнения.Свойство("ПредыдущийТитул")  Тогда

		ПЭ1_Ссылка = ДанныеЗаполнения.ПредыдущийТитул;
		
		ДанныеЗаполнения.Свойство("ФайлОбмена", ФайлОбмена);
		
		Если Не ЗначениеЗаполнено(ФайлОбмена) Тогда 
			ФайлОбмена = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиФайлТитулаПоГлавномуДокументу(ПЭ1_Ссылка, 
									Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1);
		КонецЕсли;
									
		ОбщиеРеквизиты = "НомДок, ДатаДок, СвКлиент, СвЭксп, ДогТрЭксп, УИД_ПорЭксп, kl_id";
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПЭ1_Ссылка, ОбщиеРеквизиты);
		
		Титул1 = ПЭ1_Ссылка;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			СообщитьПользователю("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ФайлСсылка.ГлавныйДокумент) Тогда 
			
			ОбщиеРеквизиты = "НомДок, ДатаДок, СвКлиент, СвЭксп, ДогТрЭксп, УИД_ПорЭксп, kl_id";
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ФайлСсылка.ГлавныйДокумент, ОбщиеРеквизиты);
			
			Титул1 = ФайлСсылка.ГлавныйДокумент;
			
		КонецЕсли;
		
		// Идентификатор в Логистике
		kl_id = ФайлСсылка.kl_id;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
			
	КонецЕсли;		

	Пользователь1с = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
	ЗаполнитьРеквизитыПоПользователю(Пользователь1с);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю(ВходящийПользователь1С = Неопределено) Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания)  Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				СвЭксп, , , ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			Если ВходящийПользователь1С = Неопределено Тогда
				ПользовательПодписант = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
			Иначе
				ПользовательПодписант = ВходящийПользователь1С;	
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку( "ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ПЭ_Титул2.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ДатИнфКлт = ТекущаяДатаСеанса();
	ВрИнфКлт = ТекущаяДатаСеанса();
	
	Попытка
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфКлт, ВрИнфКлт);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		ПараметрыФайлаРеквизиты = Новый Структура ("ТребуетсяПодпись", Истина);
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		// Записать(); // запишем  ДатИнфФт и ВрИнфФт
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Разблокировать();
		
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		СообщитьПользователю(ТекстОшибки);
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
КонецФункции 

Процедура ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO = КС.ПолучитьXDTOпоXML(ТекстФайла);
	СодИнфЭксп = XDTO.Документ.СодИнфЭксп; 
	
	МассивЭлементов = Новый Массив;
	
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "УИД_ПорЭксп", "УИД_ПорЭксп", "");
	КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, СодИнфЭксп, ЭтотОбъект);
	
	ЗаполнитьИныеДанныеЭксп(СодИнфЭксп);
	ЗаполнитьДопИнфЭксп(СодИнфЭксп);
		
	КС.ЗаполнитьИнфПолИзXDTO(СодИнфЭксп, ЭтотОбъект, "ИнфПол");
	
КонецПроцедуры

Процедура ЗаполнитьДопИнфЭксп(СодИнфЭксп)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO_ДопИнфЭксп = КС.XDTO_Вычислить(СодИнфЭксп, "ДопИнфЭксп");
	XDTO_ДопИнфЭксп = КС.XDTO_ВычислитьМассивXDTO(XDTO_ДопИнфЭксп);
	
	МассивЭлементов = Новый Массив;

	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "ПризИсп",  "ПризнИсп",  "ТипИсполненияЭкспСвоихОбязательст");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "Количество",  "КолУсл",  "Число");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "РекИдПредст",  "СвПредстЭксп.РекИдПредст",  "УчастникТип");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "ОснОкУслИным",  "СвПредстЭксп.ОснОкУслИным",  "РеквДокТип");
	
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "ОбщСтУсл",  "СвОплата.ОбщСтУсл",  "Число");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "НалСт",  "СвОплата.НалСт",  "СтавкиНДС");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "НаимДок_СвОплата",  "СвОплата.РеквНаимДок",  "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "НомерДок_СвОплата",  "СвОплата.ОснДовОргСост",  "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "ДатаДок_СвОплата",  "СвОплата.РеквДатаДок",  "ДатаТип");
	
	Для Каждого Элемент Из XDTO_ДопИнфЭксп Цикл
		
		НоваяСтрока = ДопИнфЭксп.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		 
		НоваяСтрока.Услуга = Справочники.КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.НайтиСоздатьПоОбъектуXDTO(Элемент);
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Элемент, НоваяСтрока);
		
		КодВалюты = КС.XDTO_Вычислить(Элемент, "СвОплата.КодОКВ");
		НаименованиеВалюты = КС.XDTO_Вычислить(Элемент, "СвОплата.НаимОКВ");
		Если ЗначениеЗаполнено(КодВалюты) Или ЗначениеЗаполнено(НаименованиеВалюты) Тогда
			НоваяСтрока.Валюта = КонтурЛогистика_КонвертацияСервер.КонвертироватьВалютуИзЛогистикиВ1С(КодВалюты, НаименованиеВалюты);
		КонецЕсли;
		
		КС.ЗаполнитьИнфПолИзXDTOсИдФайл(Элемент, ЭтотОбъект, "ИнфПол", НоваяСтрока.ИдентификаторСтроки, "ИдентификаторСтроки");
		
		ЗаполнитьМаршрут(Элемент, НоваяСтрока.ИдентификаторСтроки);
		ЗаполнитьИдентификаторыПартий(Элемент, НоваяСтрока);
	
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьМаршрут(Услуга, Идентификатор)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO_СвТрсГруз = КС.XDTO_Вычислить(Услуга, "СвТрсГруз");
	XDTO_СвТрсГруз = КС.XDTO_ВычислитьМассивXDTO(XDTO_СвТрсГруз);
	
	МассивЭлементов = Новый Массив;

	Для Каждого Элемент Из XDTO_СвТрсГруз Цикл
		
		НоваяСтрока = СвТрсГруз.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		НоваяСтрока.ИдентификаторСтрокиРодитель = Идентификатор;
		НоваяСтрока.МаршСлГруз = КС.XDTO_Вычислить(Элемент, "МаршСлГруз");
		 
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Элемент, НоваяСтрока);
		
		ЗаполнитьТранспортВодителей(Элемент, НоваяСтрока.ИдентификаторСтроки);
	
	КонецЦикла;	
		
КонецПроцедуры

Процедура ЗаполнитьИдентификаторыПартий(Услуга, НоваяСтрока)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO_ИдентПартГруз = КС.XDTO_Вычислить(Услуга, "ИдентПартГруз");
	XDTO_ИдентПартГруз = КС.XDTO_ВычислитьМассивXDTO(XDTO_ИдентПартГруз);
	
	Для Каждого Элемент Из XDTO_ИдентПартГруз Цикл
		НоваяСтрока.ИдентификаторыПартий = Элемент + ";"; 
	КонецЦикла;
	
	XDTO_НомПартГруз = КС.XDTO_Вычислить(Услуга, "НомПартГруз");
	XDTO_НомПартГруз = КС.XDTO_ВычислитьМассивXDTO(XDTO_НомПартГруз);
		
	Для Каждого Элемент Из XDTO_НомПартГруз Цикл
		НоваяСтрока.НомераПартий = Элемент + ";"; 
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьТранспортВодителей(Маршрут, Идентификатор)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO_СвТсДост = КС.XDTO_Вычислить(Маршрут, "СвТсДост");
	XDTO_СвТсДост = КС.XDTO_ВычислитьМассивXDTO(XDTO_СвТсДост);
	
	МассивЭлементов = Новый Массив;

	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "ВидТС",  "ВидТС",  "ВидыТранспорта");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "ТипКузова",  "ТипКузова",  "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "РегНомер",  "РегНомер",  "РегНомер");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "Марка",  "Марка",  "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "Модель",  "Модель",  "");
	
	Для Каждого Элемент Из XDTO_СвТсДост Цикл
		
		НоваяСтрока = СвТсДост.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		НоваяСтрока.ИдентификаторСтрокиРодитель = Идентификатор;
		 
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Элемент, НоваяСтрока);
		
		Если ЗначениеЗаполнено("НоваяСтрока.РегНомер") Тогда
			НоваяСтрока.ТранспортноеСредство = Справочники.КонтурЛогистика_ТранспортныеСредства.НайтиТранспортноеСредствоПоРегНомер(НоваяСтрока.РегНомер); 
		КонецЕсли;	
		
		ЗаполнитьВодителей(Элемент, НоваяСтрока.ИдентификаторСтроки);
	
	КонецЦикла;		
	
КонецПроцедуры	

Процедура ЗаполнитьВодителей(Транспорт, Идентификатор)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO_Водитель = КС.XDTO_Вычислить(Транспорт, "СвВодит");
	XDTO_Водитель = КС.XDTO_ВычислитьМассивXDTO(XDTO_Водитель);
	
	МассивЭлементов = Новый Массив;

	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "РеквНаимДок",  "ПутевойЛист.РеквНаимДок",  "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "РеквНомерДок",  "ПутевойЛист.ОснДовОргСост",  "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "РеквДатаДок",  "ПутевойЛист.РеквДатаДок",  "ДатаТип");
		
	Для Каждого Элемент Из XDTO_Водитель Цикл
		
		НоваяСтрока = Водители.Добавить();
		НоваяСтрока.ИдентификаторСтрокиРодитель = Идентификатор;
		 
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Элемент, НоваяСтрока);
		
		НоваяСтрока.Водитель = КС.Конвертировать_СвВодит_вВодителяЛогистика(Элемент);
	
	КонецЦикла;		
	
КонецПроцедуры	

Процедура ЗаполнитьИныеДанныеЭксп(СодИнфЭксп)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ИныеДанЭкспМас = КС.XDTO_Вычислить(СодИнфЭксп, "ИныеДанЭксп");
	ИныеДанЭкспМас = КС.XDTO_ВычислитьМассивXDTO(ИныеДанЭкспМас);
	
	Для Каждого ИныеДанные Из ИныеДанЭкспМас Цикл 
		НоваяСтрока = ИныеДанныеЭксп.Добавить();
		НоваяСтрока.ДанныеИОговорки = ИныеДанные; 
	КонецЦикла;
	
КонецПроцедуры	

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	ТипДокументооборота = "__PE";
	НомерТитула = 2;
	Формат = "5.01";
	ТипКодировки = "utf-8";
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	// W = Число(ДополнительныеПолучателиФайла.Количество() > 0);
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаПЭ(СвКлиент, СвЭксп, 0, GUID, 2); 

	Результат.Вставить("ИдФайл", XDTO_Файл.ИдФайл);
	
	Документ = КС.XDTO_Документ(НомерТитула, ТипДокументооборота);
	Документ.КНД = Документы.КонтурЛогистика_ПЭ_Титул2.КНД();
	Документ.НаимДок = Документы.КонтурЛогистика_ПЭ_Титул2.НаимДок();
	Документ.ДатИнфЭксп = КС.XDTO_ДатаТип(ДатаФормирования);
	Документ.ВрИнфЭксп = КС.XDTO_ВремяТип(ВремяФормирования);
	
	КС.XDTO_Установить(Документ, "ИдИнфКлнт", XDTO_ИдИнфКлнт());
	КС.XDTO_Установить(Документ, "СодИнфЭксп", XDTO_СодИнфЭксп(Формат));
	
	ПодписантСтруктура = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		СвЭксп, ПользовательПодписант, ДатаФормирования, ЭтотОбъект);
	XDTO_Подписант = КС.XDTO_Подписант_ПЭ(ПодписантСтруктура, НомерТитула); 
	КС.XDTO_Установить(Документ, "ПодпИнфЭксп", XDTO_Подписант);
	
	КС.XDTO_Установить(XDTO_Файл, "Документ", Документ);
	
	ТекстФайла = КС.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат, ТипКодировки);
	
	Результат.Вставить("ТекстФайла", ТекстФайла);
	Результат.Вставить("GUID", GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция XDTO_ИдИнфКлнт()
	
	КС = КонтурЛогистика_КонструкторыXDTO;

	ФайлОбмена = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиФайлТитулаПоГлавномуДокументу(Ссылка.Титул1,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1);

	Если ЗначениеЗаполнено(ФайлОбмена) Тогда
		
		ТекстФайла = ФайлОбмена.ТекстXML.Получить();
		
		XDTO = КС.ПолучитьXDTOпоXML(ТекстФайла);
		ИдФайлИнфКлнт = XDTO.ИдФайл;
		ДатФайлИнфКлнт = XDTO.Документ.ДатИнфКлнт;
		ВрФайлИнфКлнт = XDTO.Документ.ВрИнфКлнт;

		ДвоичныеДанныеПодписи = ФайлОбмена.Подпись.Получить();
		ЭП = Base64Строка(ДвоичныеДанныеПодписи);

		XDTO_ИдИнфКлнт = КС.XDTO_ИдИнфКлнт(ИдФайлИнфКлнт, ДатФайлИнфКлнт, ВрФайлИнфКлнт, ЭП);

	КонецЕсли;

	Возврат XDTO_ИдИнфКлнт;

КонецФункции

Функция XDTO_СодИнфЭксп(Формат)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO_Объект = КС.XDTO_СодИнфПЭ2();
	КС.XDTO_Установить(XDTO_Объект, "УИД_ПорЭксп", УИД_ПорЭксп);
	
	XDTO_Объект.НомРеестр = СвЭксп.НомРеестр;
	XDTO_Объект.ДатаРеестр = КС.XDTO_ДатаТип(СвЭксп.ДатаРеестр);
	КС.XDTO_Установить(XDTO_Объект, "СодОпер", Документы.КонтурЛогистика_ПЭ_Титул2.СодОпер());
	
	// 
	// КС.XDTO_Установить(XDTO_Объект, "ИдИсхФайл", ); при наличие ИспрФО
	// Пока не реализовано, механизм внесений исправлений в файл обмена по требованию ФГИС
	 
	Для Каждого ДанныеИОговорки Из ИныеДанныеЭксп Цикл 
		XDTO_Объект.ИныеДанЭксп.Добавить(ДанныеИОговорки.ДанныеИОговорки);    
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ДопИнфЭксп Цикл 
		XDTO_Объект.ДопИнфЭксп.Добавить(XDTO_ДопИнфЭксп(Формат, СтрокаДанных));    
	КонецЦикла;
	 
	КС.УстановитьИнфПол(XDTO_Объект, ИнфПол, 2, "__PE", Формат);
	
	Возврат XDTO_Объект;
	
КонецФункции

Функция XDTO_ДопИнфЭксп(Формат, Данные)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO_Объект = КС.XDTO_ДопИнфЭксп();
	XDTO_Объект.ПризнИсп = КС.СериализоватьПеречисление(Данные.ПризИсп);
	
	УслугаСсылка = Данные.Услуга;
	КС.XDTO_Установить(XDTO_Объект, "ИдентУсл", УслугаСсылка.ИдентУсл);
	Если ЗначениеЗаполнено(УслугаСсылка.НаименованиеУслуги) Тогда
		КС.XDTO_Установить(XDTO_Объект, "НаимУсл", УслугаСсылка.НаименованиеУслуги);
	Иначе 
		КС.XDTO_Установить(XDTO_Объект, "НаимУсл", "Перевозка");
	КонецЕсли;
	
	КС.XDTO_Установить(XDTO_Объект, "КодУсл", УслугаСсылка.КодУслуги);
	КС.XDTO_Установить(XDTO_Объект, "ХарактУсл", УслугаСсылка.ХарактУсл);
	КС.XDTO_Установить(XDTO_Объект, "ОКЕИ_Усл", УслугаСсылка.ОКЕИ_Усл);
	КС.XDTO_Установить(XDTO_Объект, "НаимЕдИзм", УслугаСсылка.НаимЕдИзм);
	
	КС.XDTO_Установить(XDTO_Объект, "КолУсл", Данные.Количество);
	
	КС.XDTO_Установить(XDTO_Объект, "СвОплата", КС.XDTO_СвОплата(Данные, Формат));
	
	Если Данные.ПризИсп = Перечисления.КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст._2 
		ИЛИ Данные.ПризИсп = Перечисления.КонтурЛогистика_ТипИсполненияЭкспСвоихОбязательст._3 Тогда 	
	
		СвПредстЭксп = КС.XDTO_СвПредстЭксп();
		Если ЗначениеЗаполнено(Данные.РекИдПредст) Тогда 
			КС.XDTO_Установить(СвПредстЭксп, "РекИдПредст", КС.XDTO_УчастникТрН(2, Формат, Данные.РекИдПредст, "__PE"));
		Иначе 
			КС.XDTO_Установить(СвПредстЭксп, "РекИдПредст", КС.XDTO_УчастникТипВводВручную(Данные, Формат));
		КонецЕсли;
		Если ЗначениеЗаполнено(Данные.ОснОкУслИным) Тогда
			КС.XDTO_Установить(СвПредстЭксп, "ОснОкУслИным", КС.XDTO_РеквДокТипПоСсылкеДоговору(2, Данные.ОснОкУслИным, "__PE", Формат));
		КонецЕсли;
		КС.XDTO_Установить(XDTO_Объект, "СвПредстЭксп", СвПредстЭксп); 
		
	КонецЕсли;
		
	УстановитьТСВодителей(Формат, Данные.ИдентификаторСтроки, XDTO_Объект);	
	
	Возврат XDTO_Объект;
	
КонецФункции 

Процедура УстановитьТСВодителей(Формат, ИдентификаторСтроки, XDTO_Объект)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Отбор = Новый Структура("ИдентификаторСтрокиРодитель", ИдентификаторСтроки);
	МассивСтрок = СвТрсГруз.НайтиСтроки(Отбор);
	
	Для Каждого Партия Из МассивСтрок Цикл
		
		Если ЗначениеЗаполнено(Партия.ИдентПартГруз) Тогда
			XDTO_Объект.ИдентПартГруз.Добавить(Партия.ИдентПартГруз);
		КонецЕсли;		
		Если ЗначениеЗаполнено(Партия.НомПартГруз) Тогда 
			XDTO_Объект.НомПартГруз.Добавить(Партия.НомПартГруз);
		КонецЕсли;	
		
		XDTO_Партия = КС.XDTO_СвТрсГруз(Формат);
		КС.XDTO_Установить(XDTO_Партия, "МаршСлГруз", СформироватьМаршрутСледования(Партия.маршрут));
		
		Отбор = Новый Структура("ИдентификаторСтрокиРодитель", Партия.ИдентификаторСтроки);
		МассивСтрок = СвТсДост.НайтиСтроки(Отбор);
			
			Для Каждого ТС Из МассивСтрок Цикл
				
				ТранспортноеСредство = КС.XDTO_СвТСДост(ТС.ТранспортноеСредство, ТС.ВидТС, Формат);
					
					Отбор = Новый Структура("ИдентификаторСтрокиРодитель", ТС.ИдентификаторСтроки);
					МассивСтрок = Водители.НайтиСтроки(Отбор);					
					
					Для Каждого СтрокаВодитель Из МассивСтрок Цикл
						
						СвВодит = КС.XDTO_СвВодит(2, СтрокаВодитель.Водитель, "__PE", "СодИнфЭксп.ДопИнфЭксп.СвТрсГруз.СвТСДост.СвВодит", Формат);
						Если ЗначениеЗаполнено(СтрокаВодитель.РеквДатаДок) И ЗначениеЗаполнено(СтрокаВодитель.РеквНомерДок) Тогда 
							ПутевойЛист = КС.XDTO_РеквДокТип_Экспедитор(СтрокаВодитель, 2, "__PE");
							КС.XDTO_Установить(СвВодит, "ПутевойЛист", ПутевойЛист);
						КонецЕсли;
						
						ТранспортноеСредство.СвВодит.Добавить(СвВодит);
						
					КонецЦикла;
									
				XDTO_Партия.СвТсДост.Добавить(ТранспортноеСредство);
				
			КонецЦикла;	
		
		XDTO_Объект.СвТрсГруз.Добавить(XDTO_Партия);	
		 
	КонецЦикла;	
	
КонецПроцедуры	

Функция СформироватьМаршрутСледования(Маршрут)
	
	Если ЗначениеЗаполнено(Маршрут.МаршСлГруз) Тогда
		Результат = Маршрут.МаршСлГруз;
	Иначе 
		Результат = "Точка погрузки: ";
		Результат = Результат + Маршрут.АдрГруз + "; Точка доставки: " + Маршрут.АдрПунктНазн; 
	КонецЕсли;		
	
	Возврат Результат
	
КонецФункции

Процедура СообщитьПользователю(ТекстСообщения)
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры	

#КонецЕсли
